In [1]:
%pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\gigiya\desktop\dpho1\venv\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\users\gigiya\desktop\dpho1\venv\lib\site-packages (from ipython-sql) (3.10.0)
Requirement already satisfied: ipython in c:\users\gigiya\desktop\dpho1\venv\lib\site-packages (from ipython-sql) (8.24.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\gigiya\desktop\dpho1\venv\lib\site-packages (from ipython-sql) (2.0.30)
Requirement already satisfied: sqlparse in c:\users\gigiya\desktop\dpho1\venv\lib\site-packages (from ipython-sql) (0.5.0)
Requirement already satisfied: six in c:\users\gigiya\desktop\dpho1\venv\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\gigiya\desktop\dpho1\venv\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\gigiya\desktop\dpho1\venv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\gigiya\desktop\dpho1\venv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.3)
Requirement already satisfied: decorator in c:\users\gigiya\desktop\dpho1\venv\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\gigiya\desktop\dpho1\venv\lib\site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in c:\users\gigiya\desktop\dpho1\venv\lib\site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in c:\users\gigiya\desktop\dpho1\venv\lib\site-packages (from ipython->ipython-sql) (3.0.44)
Requirement already satisfied: pygments>=2.4.0 in c:\users\gigiya\desktop\dpho1\venv\lib\site-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: stack-data in c:\users\gigiya\desktop\dpho1\venv\lib\site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\gigiya\desktop\dpho1\venv\lib\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: colorama in c:\users\gigiya\desktop\dpho1\venv\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: wcwidth in c:\users\gigiya\desktop\dpho1\venv\lib\site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in c:\users\gigiya\desktop\dpho1\venv\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: executing>=1.2.0 in c:\users\gigiya\desktop\dpho1\venv\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.1)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\gigiya\desktop\dpho1\venv\lib\site-packages (from stack-data->ipython->ipython-sql) (2.4.1)
Requirement already satisfied: pure-eval in c:\users\gigiya\desktop\dpho1\venv\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Note: you may need to restart the kernel to use updated packages.

In [2]:
%load_ext sql

In [3]:

%sql sqlite:///sample-database.db

In [4]:

%%sql
CREATE TABLE IF NOT EXISTS Employee (
    FirstName Varchar (50) NOT NULL,
    LastName varchar (50) NOT NULL,
    EmployeeID INT PRIMARY KEY
);

 * sqlite:///sample-database.db
Done.

[]

In [5]:
# Shows structure of table
%sql PRAGMA table_info ('Employee');

 * sqlite:///sample-database.db
Done.

[(0, 'FirstName', 'Varchar (50)', 1, None, 0),
 (1, 'LastName', 'varchar (50)', 1, None, 0),
 (2, 'EmployeeID', 'INT', 0, None, 1)]

In [6]:
%%sql
CREATE TABLE IF NOT EXISTS CLassRoaster (
    FirstName Varchar (50) NOT NULL,
    LastName varchar (50) NOT NULL,
    StudentID INT PRIMARY KEY
);

 * sqlite:///sample-database.db
Done.

[]

In [7]:
%sql PRAGMA table_info ('ClassRoaster');

 * sqlite:///sample-database.db
Done.

[(0, 'FirstName', 'Varchar (50)', 1, None, 0),
 (1, 'LastName', 'varchar (50)', 1, None, 0),
 (2, 'EmployeeID', 'INT', 0, None, 1),
 (3, 'Scores', 'INT', 0, None, 0)]

In [8]:
%%sql
ALTER TABLE ClassRoaster
ADD Scores INT;

 * sqlite:///sample-database.db
(sqlite3.OperationalError) duplicate column name: Scores
[SQL: ALTER TABLE ClassRoaster
ADD Scores INT;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [9]:
%sql PRAGMA table_info('ClassRoaster');

 * sqlite:///sample-database.db
Done.

[(0, 'FirstName', 'Varchar (50)', 1, None, 0),
 (1, 'LastName', 'varchar (50)', 1, None, 0),
 (2, 'EmployeeID', 'INT', 0, None, 1),
 (3, 'Scores', 'INT', 0, None, 0)]

In [10]:
%%sql
INSERT INTO ClassRoaster (Firstname, LastName, EmployeeID, Scores)
VALUES ('Mike', 'Obi', 1001, 45);

 * sqlite:///sample-database.db
1 rows affected.

[]

In [11]:
%%sql
INSERT INTO ClassRoaster (Firstname, LastName, EmployeeID, Scores)
VALUES ('John', 'Obi', 1002, 50);

 * sqlite:///sample-database.db
(sqlite3.IntegrityError) UNIQUE constraint failed: CLassRoaster.EmployeeID
[SQL: INSERT INTO ClassRoaster (Firstname, LastName, EmployeeID, Scores)
VALUES ('John', 'Obi', 1002, 50);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [12]:
%%sql
INSERT INTO ClassRoaster (Firstname, LastName, EmployeeID, Scores)
VALUES ('Kate', 'Obi', 1003, 51);

%%sql
INSERT INTO ClassRoaster (Firstname, LastName, EmployeeID, Scores)
VALUES ('Victoria', 'Obi', 1004, 45);

 * sqlite:///sample-database.db
(sqlite3.IntegrityError) UNIQUE constraint failed: CLassRoaster.EmployeeID
[SQL: INSERT INTO ClassRoaster (Firstname, LastName, EmployeeID, Scores)
VALUES ('Kate', 'Obi', 1003, 51);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [13]:
%%sql
INSERT INTO ClassRoaster (Firstname, LastName, EmployeeID, Scores)
VALUES ('Victoria', 'Obi', 1004, 45);

 * sqlite:///sample-database.db
(sqlite3.IntegrityError) UNIQUE constraint failed: CLassRoaster.EmployeeID
[SQL: INSERT INTO ClassRoaster (Firstname, LastName, EmployeeID, Scores)
VALUES ('Victoria', 'Obi', 1004, 45);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [14]:
%sql SELECT * FROM ClassRoaster;

 * sqlite:///sample-database.db
Done.

[('John', 'Obi', 1002, 50),
 ('Kate', 'Obi', 1003, 51),
 ('Victoria', 'Obi', 1004, 45),
 ('Amina', 'Obi', 1005, 51),
 ('Nkiru', 'Obi', 1006, 70),
 ('Amina', 'Obi', 1008, 51),
 ('Amina', 'Obi', 1009, 51),
 ('Mike', 'Obi', 1001, 45)]

In [15]:
%sql SELECT * FROM ClassRoaster;

 * sqlite:///sample-database.db
Done.

[('John', 'Obi', 1002, 50),
 ('Kate', 'Obi', 1003, 51),
 ('Victoria', 'Obi', 1004, 45),
 ('Amina', 'Obi', 1005, 51),
 ('Nkiru', 'Obi', 1006, 70),
 ('Amina', 'Obi', 1008, 51),
 ('Amina', 'Obi', 1009, 51),
 ('Mike', 'Obi', 1001, 45)]

In [16]:
%%sql UPDATE ClassRoaster
SET Scores =70 WHERE EmployeeID =1006;

 * sqlite:///sample-database.db
1 rows affected.

[]

In [17]:
 %sql SELECT * FROM ClassRoaster;

 * sqlite:///sample-database.db
Done.

[('John', 'Obi', 1002, 50),
 ('Kate', 'Obi', 1003, 51),
 ('Victoria', 'Obi', 1004, 45),
 ('Amina', 'Obi', 1005, 51),
 ('Nkiru', 'Obi', 1006, 70),
 ('Amina', 'Obi', 1008, 51),
 ('Amina', 'Obi', 1009, 51),
 ('Mike', 'Obi', 1001, 45)]

In [18]:
%%sql DELETE FROM ClassRoaster
WHERE EmployeeID = 1001;

 * sqlite:///sample-database.db
1 rows affected.

[]

In [19]:
 %sql SELECT * FROM ClassRoaster;

 * sqlite:///sample-database.db
Done.

[('John', 'Obi', 1002, 50),
 ('Kate', 'Obi', 1003, 51),
 ('Victoria', 'Obi', 1004, 45),
 ('Amina', 'Obi', 1005, 51),
 ('Nkiru', 'Obi', 1006, 70),
 ('Amina', 'Obi', 1008, 51),
 ('Amina', 'Obi', 1009, 51)]

In [20]:
# To delete table
# %sql DROP ClassRoaster;

In [21]:
# To check for tables that exist in the database
%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///sample-database.db
Done.

[('Employee',), ('CLassRoaster',)]

# SQL METHODS

In [22]:
 %sql SELECT * FROM ClassRoaster;

 * sqlite:///sample-database.db
Done.

[('John', 'Obi', 1002, 50),
 ('Kate', 'Obi', 1003, 51),
 ('Victoria', 'Obi', 1004, 45),
 ('Amina', 'Obi', 1005, 51),
 ('Nkiru', 'Obi', 1006, 70),
 ('Amina', 'Obi', 1008, 51),
 ('Amina', 'Obi', 1009, 51)]

In [23]:
# DISTINCT FUNCTION
%sql SELECT DISTINCT FirstName,LastName FROM ClassRoaster;

 * sqlite:///sample-database.db
Done.

[('John', 'Obi'),
 ('Kate', 'Obi'),
 ('Victoria', 'Obi'),
 ('Amina', 'Obi'),
 ('Nkiru', 'Obi')]

In [24]:
%%sql
INSERT INTO ClassRoaster (FirstName, LastName, EmployeeID, Scores)
VALUES ('Amina', 'Obi', 1008, 51);

 * sqlite:///sample-database.db
(sqlite3.IntegrityError) UNIQUE constraint failed: CLassRoaster.EmployeeID
[SQL: INSERT INTO ClassRoaster (FirstName, LastName, EmployeeID, Scores)
VALUES ('Amina', 'Obi', 1008, 51);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [25]:
%sql SELECT * FROM ClassRoaster;

 * sqlite:///sample-database.db
Done.

[('John', 'Obi', 1002, 50),
 ('Kate', 'Obi', 1003, 51),
 ('Victoria', 'Obi', 1004, 45),
 ('Amina', 'Obi', 1005, 51),
 ('Nkiru', 'Obi', 1006, 70),
 ('Amina', 'Obi', 1008, 51),
 ('Amina', 'Obi', 1009, 51)]

In [26]:
%%sql
INSERT INTO ClassRoaster (FirstName, LastName, EmployeeID, Scores)
VALUES ('Amina', 'Obi', 1008, 51),
        ('Amina', 'Obi', 1009, 51);

 * sqlite:///sample-database.db
(sqlite3.IntegrityError) UNIQUE constraint failed: CLassRoaster.EmployeeID
[SQL: INSERT INTO ClassRoaster (FirstName, LastName, EmployeeID, Scores)
VALUES ('Amina', 'Obi', 1008, 51),
        ('Amina', 'Obi', 1009, 51);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [27]:
%sql SELECT * FROM ClassRoaster;

 * sqlite:///sample-database.db
Done.

[('John', 'Obi', 1002, 50),
 ('Kate', 'Obi', 1003, 51),
 ('Victoria', 'Obi', 1004, 45),
 ('Amina', 'Obi', 1005, 51),
 ('Nkiru', 'Obi', 1006, 70),
 ('Amina', 'Obi', 1008, 51),
 ('Amina', 'Obi', 1009, 51)]

In [28]:
# lIMIT
%sql SELECT * FROM ClassRoaster LIMIT 5;

 * sqlite:///sample-database.db
Done.

[('John', 'Obi', 1002, 50),
 ('Kate', 'Obi', 1003, 51),
 ('Victoria', 'Obi', 1004, 45),
 ('Amina', 'Obi', 1005, 51),
 ('Nkiru', 'Obi', 1006, 70)]

In [29]:
# Count
%sql SELECT COUNT(*) FROM ClassRoaster;

 * sqlite:///sample-database.db
Done.

[(7,)]

In [30]:
# distinct Count
%sql SELECT DISTINCT COUNT(Scores) from ClassRoaster;

 * sqlite:///sample-database.db
Done.

[(7,)]

In [31]:
%sql SELECT COUNT( DISTINCT EmployeeID) from ClassRoaster;

 * sqlite:///sample-database.db
Done.

[(7,)]

In [32]:
%Sql SELECT* FROM ClassRoaster;

UsageError: Line magic function `%Sql` not found.

In [ ]:
%sql sqlite:///practice-database.db

In [ ]:
%%sql
CREATE TABLE IF NOT EXISTS student (
    firstName Varchar (50) NOT NULL,
    lastName varchar (50) NOT NULL,
    studentID INT PRIMARY KEY
);

 * sqlite:///practice-database.db
   sqlite:///sample-database.db
Done.

[]

In [ ]:
%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///practice-database.db
   sqlite:///sample-database.db
Done.

[('student',)]

In [ ]:
%sql select * from student;

 * sqlite:///practice-database.db
   sqlite:///sample-database.db
Done.

[]

In [ ]:
%%sql insert into student (firstName, lastName, studentID)
values ('great', 'Eze', 1001);

 * sqlite:///practice-database.db
   sqlite:///sample-database.db
1 rows affected.

[]

In [ ]:
%sql PRAGMA table_info('student');

 * sqlite:///practice-database.db
   sqlite:///sample-database.db
Done.

[(0, 'firstName', 'Varchar (50)', 1, None, 0),
 (1, 'lastName', 'varchar (50)', 1, None, 0),
 (2, 'studentID', 'INT', 0, None, 1)]

In [ ]:
%%sql INSERT INTO student 
(firstName, lastName, studentID) 
VALUES ('great', 'Eze', 1002),
('great', 'Eze', 1003),
('great', 'Eze', 1004);

 * sqlite:///practice-database.db
   sqlite:///sample-database.db
3 rows affected.

[]

In [ ]:
%sql select * from student;

 * sqlite:///practice-database.db
   sqlite:///sample-database.db
Done.

[('great', 'Eze', 1001),
 ('great', 'Eze', 1002),
 ('great', 'Eze', 1003),
 ('great', 'Eze', 1004)]

In [ ]:
%%sql select * from student
where studentID !=1003;

 * sqlite:///practice-database.db
   sqlite:///sample-database.db
Done.

[('great', 'Eze', 1001), ('great', 'Eze', 1002), ('great', 'Eze', 1004)]

In [ ]:
%%sql select * from student
where studentID >1001;

 * sqlite:///practice-database.db
   sqlite:///sample-database.db
Done.

[('great', 'Eze', 1002), ('great', 'Eze', 1003), ('great', 'Eze', 1004)]